In [ ]:
# Create a Python connection with SQL database and retrieve the results of the following queries as dataframes:

# 1. How many distinct (different) actors' last names are there?


# 2. Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.


# 3. Get all films with ARMAGEDDON in the title.


# 4. Get 10 the longest films.


# 5. How many films include Behind the Scenes content?


# 6.Which kind of movies (rating) have a mean duration of more than two hours?


# 7.Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

import getpass

In [2]:
password = getpass.getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)
data = pd.read_sql_query('SELECT * FROM actor', engine) 
data.head()

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

In [5]:
data.dtypes

actor_id                int64
first_name             object
last_name              object
last_update    datetime64[ns]
dtype: object

In [7]:
# 1. How many distinct (different) actors' last names are there?

query = '''select count(distinct(last_name)) from actor '''

data1 = pd.read_sql_query(query, engine)
print(data1)

   count(distinct(last_name))
0                         121

In [9]:
# 2. Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

query = '''SELECT rental_date,
CASE
WHEN DAYNAME(rental_date) = 'Monday' then 'workday'
WHEN DAYNAME(rental_date) = 'Tuesday' then 'workday'
WHEN DAYNAME(rental_date) = 'Wednesday' then 'workday'
WHEN DAYNAME(rental_date) = 'Thursday' then 'workday'
WHEN DAYNAME(rental_date) = 'Friday' then 'workday'
ELSE 'weekend'
END AS 'day_type'
FROM rental;'''

data2 = pd.read_sql_query(query, engine)
data2.head()

          rental_date day_type
0 2005-05-24 22:53:30  workday
1 2005-05-24 22:54:33  workday
2 2005-05-24 23:03:39  workday
3 2005-05-24 23:04:41  workday
4 2005-05-24 23:05:21  workday

In [10]:
# 3. Get all films with ARMAGEDDON in the title.

query = '''SELECT title FROM film
WHERE left(title,10) = 'ARMAGEDDON' ;'''

data3 = pd.read_sql_query(query, engine)
data3.head()

             title
0  ARMAGEDDON LOST

In [11]:
# 4. Get 10 the longest films.

query = '''SELECT title, length FROM film
ORDER BY length DESC
LIMIT 10;'''

data4 = pd.read_sql_query(query, engine)
data4.head(20)

                title  length
0      DARN FORRESTER     185
1        POND SEATTLE     185
2       CHICAGO NORTH     185
3       MUSCLE BRIGHT     185
4        WORST BANGER     185
5         GANGS PRIDE     185
6  SOLDIERS EVOLUTION     185
7           HOME PITY     185
8   SWEET BROTHERHOOD     185
9      CONTROL ANTHEM     185

In [12]:
# 5. How many films include Behind the Scenes content?

query = '''SELECT count(distinct(title)) FROM film
WHERE right(special_features,17) = 'Behind the Scenes' ;'''

data5 = pd.read_sql_query(query, engine)
print(data5)

   count(distinct(title))
0                     538

In [14]:
# 6.Which kind of movies (rating) have a mean duration of more than two hours?
query ='''select rating, round(avg(length),2) as duration from film
group by rating
having duration > 120;'''

data6 = pd.read_sql_query(query, engine)
data6.head(20)

  rating  duration
0  PG-13    120.44

In [15]:
# 7.Rank films by length (filter out the rows that have nulls or 0s in length column). 
# In your output, only select the columns title, length, and the rank.

query = '''SELECT title, length, DENSE_RANK()OVER(ORDER BY length DESC) Rank1_  
FROM film
WHERE (length <> ' ') AND (length IS NOT NULL)
ORDER BY length DESC;'''

data7 = pd.read_sql_query(query, engine)
data7.head(50)

                     title  length  Rank1_
0            CHICAGO NORTH     185       1
1           CONTROL ANTHEM     185       1
2           DARN FORRESTER     185       1
3              GANGS PRIDE     185       1
4                HOME PITY     185       1
5            MUSCLE BRIGHT     185       1
6             POND SEATTLE     185       1
7       SOLDIERS EVOLUTION     185       1
8        SWEET BROTHERHOOD     185       1
9             WORST BANGER     185       1
10       CONSPIRACY SPIRIT     184       2
11        CRYSTAL BREAKING     184       2
12          KING EVOLUTION     184       2
13         MOONWALKER FOOL     184       2
14         SMOOCHY CONTROL     184       2
15          SONS INTERVIEW     184       2
16          SORORITY QUEEN     184       2
17          THEORY MERMAID     184       2
18           CATCH AMISTAD     183       3
19          FRONTIER CABIN     183       3
20           SCALAWAG DUCK     183       3
21               WIFE TURN     183       3
22          YOUNG LANGUAGE     183       3
23         BAKED CLEOPATRA     182       4
24           MONSOON CAUSE     182       4
25           RECORDS ZORRO     182       4
26              REDS POCUS     182       4
27             SATURN NAME     182       4
28          SEARCHERS WAIT     182       4
29        ANALYZE HOOSIERS     181       5
30        HAUNTING PIANIST     181       5
31         HOTEL HAPPINESS     181       5
32          INTRIGUE WORST     181       5
33           JACKET FRISCO     181       5
34          LAWLESS VISION     181       5
35           LOVE SUICIDES     181       5
36      RUNAWAY TENENBAUMS     181       5
37          STAR OPERATION     181       5
38             WILD APOLLO     181       5
39         ALLEY EVOLUTION     180       6
40  CONFIDENTIAL INTERVIEW     180       6
41          IMPACT ALADDIN     180       6
42             MIXED DOORS     180       6
43      MUSSOLINI SPOILERS     180       6
44           NASH CHOCOLAT     180       6
45          SOMETHING DUCK     180       6
46         ANONYMOUS HUMAN     179       7
47             BORN SPINAL     179       7
48       CASUALTIES ENCINO     179       7
49              CAUSE DATE     179       7